#pragma once
#include <string>
#include <vector>
#include <memory>

// Decompiled by Jad v1.5.8g. Copyright 2001 Pavel Kouznetsov.
// Jad home page: http://www.kpdus.com/jad.html
// Decompiler options: packimports(3) 
// Source File Name:   IsoObject.java
namespace zombie {
namespace iso {
#include "THashMap.h"
#include <fstream>
#include <iostream>
#include "ByteBuffer.h"
#include "MessageDigest.h"
#include <algorithm>
#include "J2SEPlatform.h"
#include "KahluaTable.h"
#include "GameTime.h"
#include "GameWindow.h"
#include "LuaManager.h"
#include "SoundManager.h"
#include "WorldSoundManager.h"
#include "characters.h"
#include "NulledArrayList.h"
#include "Core.h"
#include "Rand.h"
#include "Bucket.h"
#include "BucketManager.h"
#include "PropertyContainer.h"
#include "ColorInfo.h"
#include "Texture.h"
#include "Mouse.h"
#include "inventory.h"
#include "HandWeapon.h"
#include "IsoFlagType.h"
#include "IsoObjectType.h"
#include "IsoBarricade.h"
#include "IsoCrate.h"
#include "IsoCurtain.h"
#include "IsoDeadBody.h"
#include "IsoDoor.h"
#include "IsoJukebox.h"
#include "IsoLightSwitch.h"
#include "IsoMolotovCocktail.h"
#include "IsoRadio.h"
#include "IsoStove.h"
#include "IsoTree.h"
#include "IsoWheelieBin.h"
#include "IsoWindow.h"
#include "IsoWorldInventoryObject.h"
#include "IsoZombieGiblets.h"
#include "IsoAnim.h"
#include "IsoDirectionFrame.h"
#include "IsoSprite.h"
#include "IsoSpriteInstance.h"
#include "IsoSpriteManager.h"
#include "ui.h"
// Referenced classes of package zombie.iso:
//            IsoPushableObject, Vector2, IsoPhysicsObject, IsoMovingObject, 
//            IsoGridSquare, IsoDirections, SliceY, IsoWorld, 
//            IsoCell, IsoUtils, IsoCamera
class IsoObject {
public:
    implements Serializable
{
	/*      */   public static enum VisionResult
	/*      */   {
	/*  984 */     NoEffect, 
	/*  985 */     Blocked, 
	/*  986 */     Unblocked;
	/*      */   }
    public static bool DoChecksumCheck(std::string str, std::string expected)
    {
        std::string checksum = "";
        try
        {
            checksum = getMD5Checksum(str);
            if(!checksum == expected))
                return false;
        }
        catch(Exception ex)
        {
            checksum = "";
            try
            {
                checksum = getMD5Checksum((new StringBuilder()).append("D:/Dropbox/Zomboid/zombie/build/classes/").append(str).toString());
            }
            catch(Exception ex1)
            {
                return false;
            }
        }
        return checksum == expected);
    }
    public static bool DoChecksumCheck()
    {
        if(!DoChecksumCheck("zombie/GameWindow.class", "c4a62b8857f0fb6b9c103ff6ef127a9b"))
            return false;
        if(!DoChecksumCheck("zombie/GameWindow$1.class", "5d93dc446b2dc49092fe4ecb5edf5f17"))
            return false;
        if(!DoChecksumCheck("zombie/GameWindow$2.class", "a3e3d2c8cf6f0efaa1bf7f6ceb572073"))
            return false;
        if(!DoChecksumCheck("zombie/gameStates/MainScreenState.class", "206848ba7cb764293dd2c19780263854"))
            return false;
        if(!DoChecksumCheck("zombie/core/textures/LoginForm.class", "02b8abc1ed8fd75db69dc6e7e390db41"))
            return false;
        if(!DoChecksumCheck("zombie/FrameLoader$1.class", "0ebfcc9557cc28d53aa982a71616bf5b"))
            return false;
        if(!DoChecksumCheck("zombie/FrameLoader.class", "d5b1f7b2886a499d848c204f6a815776"))
            return false;
        return DoChecksumCheck("zombie/core/textures/AuthenticatingFrame.class", "54f57018c6405a0006ca6ea28d55aa17");
    }
    public static byte[] createChecksum(std::string filename)
        throws Exception
    {
        InputStream fis = new FileInputStream(filename);
        byte buffer[] = new byte[1024];
        MessageDigest complete = MessageDigest.getInstance("MD5");
        int numRead;
        do
        {
            numRead = fis.read(buffer);
            if(numRead > 0)
                complete.update(buffer, 0, numRead);
        } while(numRead != -1);
        fis.close();
        return complete.digest();
    }
    public static std::string getMD5Checksum(std::string filename)
        throws Exception
    {
        byte b[] = createChecksum(filename);
        std::string result = "";
        for(int i = 0; i < b.length; i++)
            result = (new StringBuilder()).append(result).append(Integer.toString((b[i] & 0xff) + 256, 16).substring(1)).toString();
        return result;
    }
    public static IsoObject getLastRendered()
    {
        return lastRendered;
    }
    public static void setLastRendered(IsoObject aLastRendered)
    {
        lastRendered = aLastRendered;
    }
    public static IsoObject getLastRenderedRendered()
    {
        return lastRenderedRendered;
    }
    public static void setLastRenderedRendered(IsoObject aLastRenderedRendered)
    {
        lastRenderedRendered = aLastRenderedRendered;
    }
    public static void setDefaultCondition(int i)
    {
        DefaultCondition = i;
    }
    public bool Serialize()
    {
        return true;
    }
    public IsoObject(IsoCell cell)
    {
        rerouteCollide = nullptr;
        table = nullptr;
        Children = new NulledArrayList(1);
        alpha = 1.0F;
        AttachedAnimSprite = new NulledArrayList();
        container = nullptr;
        dir = IsoDirections.N;
        Damage = 100;
        NoPicking = false;
        offsetX = 0.0F;
        offsetY = -144F;
        OutlineOnMouseover = false;
        rerouteMask = nullptr;
        sprite = nullptr;
        targetAlpha = 1.0F;
        name = nullptr;
        tintr = 1.0F;
        tintg = 1.0F;
        tintb = 1.0F;
    }
    public KahluaTable getModData()
    {
        if(table == nullptr)
            table = LuaManager.platform.newTable();
        return table;
    }
    public static IsoObject factoryFromFileInput(IsoCell cell, int classID)
    {
        if(classID == "IsoObject".hashCode())
            return new IsoObject(cell);
        if(classID == "Player".hashCode())
            return new IsoPlayer(cell);
        if(classID == "Survivor".hashCode())
            return new IsoSurvivor(cell);
        if(classID == "Zombie".hashCode())
            return new IsoZombie(cell);
        if(classID == "Pushable".hashCode())
            return new IsoPushableObject(cell);
        if(classID == "WheelieBin".hashCode())
            return new IsoWheelieBin(cell);
        if(classID == "WorldInventoryItem".hashCode())
            return new IsoWorldInventoryObject(cell);
        if(classID == "Jukebox".hashCode())
            return new IsoJukebox(cell);
        if(classID == "Curtain".hashCode())
            return new IsoCurtain(cell);
        if(classID == "Radio".hashCode())
            return new IsoRadio(cell);
        if(classID == "DeadBody".hashCode())
            return new IsoDeadBody(cell);
        if(classID == "Stove".hashCode())
            return new IsoStove(cell);
        if(classID == "Door".hashCode())
            return new IsoDoor(cell);
        if(classID == "Window".hashCode())
            return new IsoWindow(cell);
        if(classID == "Curtain".hashCode())
            return new IsoCurtain(cell);
        if(classID == "Barricade".hashCode())
            return new IsoBarricade(cell);
        if(classID == "Crate".hashCode())
            return new IsoCrate(cell);
        if(classID == "Tree".hashCode())
            return new IsoTree(cell);
        if(classID == "LightSwitch".hashCode())
            return new IsoLightSwitch(cell);
        if(classID == "ZombieGiblets".hashCode())
            return new IsoZombieGiblets(cell);
        if(classID == "MolotovCocktail".hashCode())
        {
            return new IsoMolotovCocktail(cell);
        } else
        {
            IsoObject o = new IsoObject(cell);
            return o;
        }
    }
    public static Class factoryClassFromFileInput(IsoCell cell, int classID)
    /*      */   {
    /*  320 */     if (classID == "IsoObject".hashCode())
    /*      */     {
    /*  322 */       return IsoObject.class;
    /*      */     }
    /*  324 */     if (classID == "Player".hashCode())
    /*      */     {
    /*  326 */       return IsoPlayer.class;
    /*      */     }
    /*  328 */     if (classID == "Survivor".hashCode())
    /*      */     {
    /*  330 */       return IsoSurvivor.class;
    /*      */     }
    /*  332 */     if (classID == "Zombie".hashCode())
    /*      */     {
    /*  334 */       return IsoZombie.class;
    /*      */     }
    /*  336 */     if (classID == "Pushable".hashCode())
    /*      */     {
    /*  338 */       return IsoPushableObject.class;
    /*      */     }
    /*  340 */     if (classID == "WheelieBin".hashCode())
    /*      */     {
    /*  342 */       return IsoWheelieBin.class;
    /*      */     }
    /*      */ 
    /*  345 */     if (classID == "WorldInventoryItem".hashCode())
    /*      */     {
    /*  347 */       return IsoWorldInventoryObject.class;
    /*      */     }
    /*  349 */     if (classID == "Jukebox".hashCode())
    /*      */     {
    /*  351 */       return IsoJukebox.class;
    /*      */     }
    /*  353 */     if (classID == "Curtain".hashCode())
    /*      */     {
    /*  355 */       return IsoCurtain.class;
    /*      */     }
    /*  357 */     if (classID == "Radio".hashCode())
    /*      */     {
    /*  359 */       return IsoRadio.class;
    /*      */     }
    /*  361 */     if (classID == "DeadBody".hashCode())
    /*      */     {
    /*  363 */       return IsoDeadBody.class;
    /*      */     }
    /*  365 */     if (classID == "Stove".hashCode())
    /*      */     {
    /*  367 */       return IsoStove.class;
    /*      */     }
    /*  369 */     if (classID == "Door".hashCode())
    /*      */     {
    /*  371 */       return IsoDoor.class;
    /*      */     }
    /*  373 */     if (classID == "Window".hashCode())
    /*      */     {
    /*  375 */       return IsoWindow.class;
    /*      */     }
    /*  377 */     if (classID == "Curtain".hashCode())
    /*      */     {
    /*  379 */       return IsoCurtain.class;
    /*      */     }
    /*  381 */     if (classID == "Barricade".hashCode())
    /*      */     {
    /*  383 */       return IsoBarricade.class;
    /*      */     }
    /*  385 */     if (classID == "Crate".hashCode())
    /*      */     {
    /*  387 */       return IsoCrate.class;
    /*      */     }
    /*  389 */     if (classID == "Tree".hashCode())
    /*      */     {
    /*  391 */       return IsoTree.class;
    /*      */     }
    /*  393 */     if (classID == "LightSwitch".hashCode())
    /*      */     {
    /*  395 */       return IsoLightSwitch.class;
    /*      */     }
    /*  397 */     if (classID == "ZombieGiblets".hashCode())
    /*      */     {
    /*  399 */       return IsoZombieGiblets.class;
    /*      */     }
    /*  401 */     if (classID == "MolotovCocktail".hashCode())
    /*      */     {
    /*  403 */       return IsoMolotovCocktail.class;
    /*      */     }
    /*      */ 
    /*  407 */     return IsoObject.class;
    /*      */   }
    static IsoObject factoryFromFileInput(IsoCell cell, DataInputStream input)
        throws IOException
    {
        bool serialise = input.readBoolean();
        if(!serialise)
        {
            return nullptr;
        } else
        {
            int classID = input.readInt();
            IsoObject o = factoryFromFileInput(cell, classID);
            return o;
        }
    }
    public static IsoObject factoryFromFileInput(IsoCell cell, ByteBuffer b)
        throws IOException
    {
        bool serialise = b.get() != 0;
        if(!serialise)
        {
            return nullptr;
        } else
        {
            int classID = b.getInt();
            IsoObject o = factoryFromFileInput(cell, classID);
            return o;
        }
    }
    public IsoGridSquare getSquare()
    {
        return square;
    }
    public void update()
    {
    }
    public void renderlast()
    {
    }
